app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id]) #finding the student by ID
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]